```\nResource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.main will be created
  + resource "digitalocean_kubernetes_cluster" "main" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (known after apply)
      + name           = "main"
      + region         = "ams3"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + updated_at     = (known after apply)
      + version        = "1.14.1-do.4"

      + node_pool {
          + id         = (known after apply)
          + name       = "budget-pool"
          + node_count = 3
          + nodes      = (known after apply)
          + size       = "s-1vcpu-2gb"
          + tags       = [
              + "budget",
            ]
        }
    }

  # helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + chart            = "stable/grafana"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "grafana"
      + namespace        = "monitoring"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "ingress:\n  enabled: true\n  hosts:\n    - grafana.codecomet.io\n\npersistence:\n  enabled: true\n  accessModes:\n    - ReadWriteOnce\n  size: 10Gi\n\nplugins:\n  - grafana-piechart-panel\n\ndatasources:\n  datasources.yaml:\n    apiVersion: 1\n    datasources:\n    - name: Prometheus\n      type: prometheus\n      url: http://prometheus-server\n      access: proxy\n      isDefault: true\n    - name: Loki\n      type: loki\n      url: http://loki:3100\n      access: proxy\n\ndashboardProviders:\n  dashboardproviders.yaml:\n    apiVersion: 1\n    providers:\n    - name: 'default'\n      orgId: 1\n      folder: ''\n      type: file\n      disableDeletion: false\n      editable: true\n      options:\n        path: /var/lib/grafana/dashboards/default\n\ndashboards:\n  default:\n    cluster-monitoring:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/cluster-monitoring.json\n    mongodb:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/mongodb.json\n    mysql:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/mysql.json\n    nodejs-express:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/nodejs-express.json\n    traefik:\n      url: https://raw.githubusercontent.com/toxsickcoder/kubernetes-terraform/master/src/helm/monitoring/grafana-dashboards/traefik.json\n",
        ]
      + verify           = false
      + version          = "3.5.7"
      + wait             = true
    }

  # helm_release.loki will be created
  + resource "helm_release" "loki" {
      + chart            = "loki/loki"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "loki"
      + namespace        = "monitoring"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "persistence:\n  enabled: true\n  storageClassName: \"\"\n",
        ]
      + verify           = false
      + version          = "0.10.0"
      + wait             = true
    }

  # helm_release.mongodb will be created
  + resource "helm_release" "mongodb" {
      + chart            = "stable/mongodb"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "mongodb"
      + namespace        = "data"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "replicaSet:\n  enabled: true\n\nmetrics:\n  enabled: true\n  livenessProbe:\n    enabled: true\n  readinessProbe:\n    enabled: true\n",
        ]
      + verify           = false
      + version          = "5.20.3"
      + wait             = true
    }

  # helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + chart            = "stable/prometheus"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "prometheus"
      + namespace        = "monitoring"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "",
        ]
      + verify           = false
      + version          = "8.14.0"
      + wait             = true
    }

  # helm_release.promtail will be created
  + resource "helm_release" "promtail" {
      + chart            = "loki/promtail"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "promtail"
      + namespace        = "monitoring"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "loki:\n  serviceName: \"loki\"",
        ]
      + verify           = false
      + version          = "0.8.1"
      + wait             = true
    }

  # helm_release.traefik will be created
  + resource "helm_release" "traefik" {
      + chart            = "stable/traefik"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "traefik"
      + namespace        = "kube-system"
      + recreate_pods    = false
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 600
      + values           = [
          + "ssl:\n  enabled: true\n  enforced: true\n  permanentRedirect: true\n\nacme:\n  enabled: true\n  email: freek_mencke@outlook.com\n  staging: false\n  domains:\n    enabled: true\n    domainsList:\n      - main: \"*.codecomet.io\"\n      - sans:\n        - \"codecomet.io\"\n  challengeType: dns-01\n  delayBeforeCheck: 10\n  dnsProvider:\n    name: digitalocean\n\nrbac:\n  enabled: true\n\nmetrics:\n  prometheus:\n    enabled: true\n\ndeployment:\n  podAnnotations:\n    prometheus.io/port: \"8080\"\n    prometheus.io/scrape: \"true\"\n",
        ]
      + verify           = false
      + version          = "1.70.1"
      + wait             = true

      + set_sensitive {
          + name = "acme.dnsProvider.digitalocean.DO_AUTH_TOKEN"
        }
    }

  # kubernetes_cluster_role_binding.tiller will be created
  + resource "kubernetes_cluster_role_binding" "tiller" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "tiller-cluster-admin"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "tiller"
          + namespace = "kube-system"
        }
    }

  # kubernetes_namespace.data will be created
  + resource "kubernetes_namespace" "data" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "data"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.monitoring will be created
  + resource "kubernetes_namespace" "monitoring" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.tiller will be created
  + resource "kubernetes_service_account" "tiller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "tiller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.\n```
